PGM        PARM(&PARM)
DCLPRCOPT  BNDSRVPGM((QLECWI))

/* appel de la procedure stat dans QLECWI */
CALLPRC    PRC('stat') PARM(&PATH &BUF) +
             RTNVAL(&RTNVAL)
/* code retour <> de 0 , le fichier n'existe pas */
IF         COD(&RTNVAL *NE 0) THEN(SNDPGMMSG +
             MSGID(CPF9898) SGF(QCPFMSG) +
           TCAT  MSGDTA('Objet* AT' !! &PARM !< ' non +
             trouve.') MSGTYPE(*ESCAPE))
ENDPGM                                         